export function slugify(str) {
  const map = {
    а: "a",
    б: "b",
    в: "v",
    г: "g",
    д: "d",
    е: "e",
    ё: "yo",
    ж: "zh",
    з: "z",
    и: "i",
    й: "y",
    к: "k",
    л: "l",
    м: "m",
    н: "n",
    о: "o",
    п: "p",
    р: "r",
    с: "s",
    т: "t",
    у: "u",
    ф: "f",
    х: "h",
    ц: "c",
    ч: "ch",
    ш: "sh",
    щ: "sch",
    ы: "y",
    э: "e",
    ю: "yu",
    я: "ya",

    " ": "-",
    _: "-",
    "/": "-",
    "\\": "-",
  };

  return str
    .toLowerCase()
    .split("")
    .map((char) => map[char] || char)
    .join("")
    .replace(/\W+/g, "-") // заменить наборы неалфавитно-цифровых символов на дефис
    .replace(/^-+|-+$/g, ""); // убрать дефисы в начале и в конце строки
}
